import streamlit as s
import yfinance as yf
s.title('آب خشک  :wave:')
s.write('آب خشک مایعی شبیه آب است اما ویژگی های بسیار متفاوتی نسبت به آب دارد. این مایعشباهت زیادی با پودر شکر ')
s.write('دارد و قادر است تحولی زیادی در شیوه کاربرد مواد شیمیایی داشته باشد مواد تشکیل دهنده آب خشک  ریز قطره ای ')
s.write('از آب بوده که توسط پوشش سیلیکا احاطه گردیده است و 95 درصد آن آب معمولی تشکیل می دهد . ')
s.write('این آب ساخته شده توسط دانشمندان در صنعت خواهد بود که یک دستاورد مهم محسوب میشود که در سال 2000 ')
s.write('تولید شد و همچنان در زمینه های مختلف از جمله کپسول اتش نشانی استفاده میشود. ')
s.write('آب خشک  همچون آب معمولی شفافبوده و در دمای جوش قابلیت و تبخیر دارد.')
s.write('اینها همه خصوصیات آب بوده اما در مورد آب صحبت نمیکنیم بلکه درباره ماده ای صحبت میکنیم که دانشمندان')
s.write('امریکایی در سال 2000 توانستند آن را تولید کنند؛ مایعی جالب که با اینکه مایع است اما چیزی را خیس نمیکند.')
s.write('این ماده خصوصیات مشترک زیادی با آب دارد مثلا آتش را خاموش میکند و خیلی بهتر از آب از عهده این کار بر می آید.')
s.write('این مایع در دمای ۴۹ درجه سانتی گراد جوش میآید؛ بنابراین میتوانید هنگام جوشیدن بدون نگرانی دست خود را وارد آن ')
s.write('کنید. آب خشک مواد دیگر از جمله رنگها را پس میزند و از همین رو، چای خشک باعث تغییر رنگ آن نمیشود. ')
s.write('برای همین در نظافت نیز بسیار موثر است و دستگاههای برقی را خراب نمیکند و یا برای تمیز کردن فرشها دیگر منتظر خشک شدن فرش نمی مانیم.')
s.slider('چند امتیاز به این مقاله می دهی :heart:',0,1,(1,5))
s.title('موضوعات بیشتر')
s.write('ارزش بازار سهام شرکت اپل با دنبال کردن نزول شدیدی که سال گذشته داشت، روز سه شنبه کاهش چشمگیری پیدا کرد و برای نخستین بار از مارس سال ۲۰۲۱، به زیر دو تریلیون دلار رسید.')
s.write('گرفته شده از رسانه های ایسنا و آخرین خبر و ععصر ایران و باشگه خبرنگاران نوجوانان ')
s.date_input('تاریخ امروز')
data=yf.download('AAPL',start='2022-11-15' , end='2023-11-16')
s.line_chart(data)
s.markdown("""
<style> p{color:white; text-align: justify;}
*{direction:rtl;font-family: tahoma;}
*{background: black;}
img{border-radius: 20px;}

 </style>
<p>made by parsa tavana</p>
""",unsafe_allow_html=True)
